## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [6]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("im.db")

#Let's open the csv file for movie gross earnings
df = pd.read_csv("bom.movie_gross.csv")

In [19]:
#Let's look at a few pieces of information
#Let's start by finding the highest domestic grossing movie
max_dom_gross = df['domestic_gross'].max()
print(df.loc[df['domestic_gross'] == max_dom_gross])

df.loc[1872, 'foreign_gross'] = 1131561399 #Correcting the foreign gross amount to be accurate

                             title studio  domestic_gross foreign_gross  year
1872  Star Wars: The Force Awakens     BV     936700000.0    1131561399  2015

In [126]:
df_range = df.loc[(df['domestic_gross'] > 400000000.0) & (df['domestic_gross'] <= 936700000.0)]
df_range

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
727,Marvel's The Avengers,BV,623400000.0,895500000,2012
729,The Dark Knight Rises,WB,448100000.0,636800000,2012
735,The Hunger Games,LGF,408000000.0,286400000,2012
1127,Frozen,BV,400700000.0,875700000,2013
1128,Iron Man 3,BV,409000000.0,805800000,2013
1131,The Hunger Games: Catching Fire,LGF,424700000.0,440300000,2013
1872,Star Wars: The Force Awakens,BV,936700000.0,1131561399,2015
1873,Jurassic World,Uni.,652300000.0,"1,019.4",2015
1875,Avengers: Age of Ultron,BV,459000000.0,946400000,2015
2322,Captain America: Civil War,BV,408100000.0,745200000,2016
2323,Rogue One: A Star Wars Story,BV,532200000.0,523900000,2016
2324,Finding Dory,BV,486300000.0,542300000,2016
2758,Star Wars: The Last Jedi,BV,620200000.0,712400000,2017
2759,Beauty and the Beast (2017),BV,504000000.0,759500000,2017
2762,Jumanji: Welcome to the Jungle,Sony,404500000.0,557600000,2017
2767,Wonder Woman,WB,412600000.0,409300000,2017
3079,Avengers: Infinity War,BV,678800000.0,"1,369.5",2018
3080,Black Panther,BV,700100000.0,646900000,2018
3081,Jurassic World: Fallen Kingdom,Uni.,417700000.0,891800000,2018
3082,Incredibles 2,BV,608600000.0,634200000,2018

In [17]:
#let's look at the highest foreign grossing movie.
# But before that, we need to manipulate some data
#Let's look at the data types for the DF
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2037 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2037 non-null   object
 1   studio          2033 non-null   object
 2   domestic_gross  2009 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            2037 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 175.5+ KB

In [20]:
#Under foreign_gross, it appears that there are some null values, and that the type of the column is string.
#We need to remove null values, and convert to integer to find the highest foreign grossing movie.

df.dropna(subset = ['foreign_gross'], inplace = True)
df['foreign_gross'] = df['foreign_gross'].astype(str).astype(int)

ValueError: invalid literal for int() with base 10: '1,019.4'

In [67]:
#Looking at the years for this data, it looks like the years range from 2010 to 2018
#Let's split up the years
df_2010 = df.loc[df['year'] == 2010]
df_2010

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
323,The Taqwacores,Strand,11400.0,NaN,2010
324,Cherry,Abr.,11400.0,NaN,2010
325,Terkel in Trouble,Indic.,10800.0,NaN,2010
326,Kimjongilia,Lorb.,4400.0,NaN,2010
327,Aashayein (Wishes),Relbig.,NaN,3800,2010

In [83]:
df_2011 = df.loc[df['year'] == 2011]
df_2011.head()

,title,studio,domestic_gross,foreign_gross,year
328,Harry Potter and the Deathly Hallows Part 2,WB,381000000.0,960500000,2011
329,Transformers: Dark of the Moon,P/DW,352400000.0,771400000,2011
330,Pirates of the Caribbean: On Stranger Tides,BV,241100000.0,804600000,2011
331,The Twilight Saga: Breaking Dawn Part 1,Sum.,281300000.0,430900000,2011
332,Mission: Impossible - Ghost Protocol,Par.,209400000.0,485300000,2011

In [82]:
df_2012 = df.loc[df['year'] == 2012]
df_2012.head()

,title,studio,domestic_gross,foreign_gross,year
727,Marvel's The Avengers,BV,623400000.0,895500000,2012
728,Skyfall,Sony,304400000.0,804200000,2012
729,The Dark Knight Rises,WB,448100000.0,636800000,2012
730,The Hobbit: An Unexpected Journey,WB (NL),303000000.0,718100000,2012
731,Ice Age: Continental Drift,Fox,161300000.0,715900000,2012

In [81]:
df_2013 = df.loc[df['year'] == 2013]
df_2013.head()

,title,studio,domestic_gross,foreign_gross,year
1127,Frozen,BV,400700000.0,875700000,2013
1128,Iron Man 3,BV,409000000.0,805800000,2013
1129,Despicable Me 2,Uni.,368100000.0,602700000,2013
1130,The Hobbit: The Desolation of Smaug,WB (NL),258399999.0,700000000,2013
1131,The Hunger Games: Catching Fire,LGF,424700000.0,440300000,2013

In [80]:
df_2014 = df.loc[df['year'] == 2014]
df_2014.head()

,title,studio,domestic_gross,foreign_gross,year
1477,Transformers: Age of Extinction,Par.,245400000.0,858600000,2014
1478,The Hobbit: The Battle of the Five Armies,WB (NL),255100000.0,700900000,2014
1479,Guardians of the Galaxy,BV,333200000.0,440200000,2014
1480,Maleficent,BV,241400000.0,517100000,2014
1481,The Hunger Games: Mockingjay - Part 1,LGF,337100000.0,418200000,2014

In [79]:
df_2015 = df.loc[df['year'] == 2015]
df_2015.head()

                             title studio  domestic_gross foreign_gross  year
1872  Star Wars: The Force Awakens     BV     936700000.0       1,131.6  2015
1873                Jurassic World   Uni.     652300000.0       1,019.4  2015
1874                     Furious 7   Uni.     353000000.0       1,163.0  2015
1875       Avengers: Age of Ultron     BV     459000000.0     946400000  2015
1876                       Minions   Uni.     336000000.0     823400000  2015

In [78]:
df_2016 = df.loc[df['year'] == 2016]
df_2016.head()

                             title studio  domestic_gross foreign_gross  year
2322    Captain America: Civil War     BV     408100000.0     745200000  2016
2323  Rogue One: A Star Wars Story     BV     532200000.0     523900000  2016
2324                  Finding Dory     BV     486300000.0     542300000  2016
2325                      Zootopia     BV     341300000.0     682500000  2016
2326        The Jungle Book (2016)     BV     364000000.0     602500000  2016

In [76]:
df_2017 = df.loc[df['year'] == 2017]
df_2017.head()

,title,studio,domestic_gross,foreign_gross,year
2758,Star Wars: The Last Jedi,BV,620200000.0,712400000,2017
2759,Beauty and the Beast (2017),BV,504000000.0,759500000,2017
2760,The Fate of the Furious,Uni.,226000000.0,"1,010.0",2017
2761,Despicable Me 3,Uni.,264600000.0,770200000,2017
2762,Jumanji: Welcome to the Jungle,Sony,404500000.0,557600000,2017

In [77]:
df_2018 = df.loc[df['year'] == 2018]
df_2018.head()

,title,studio,domestic_gross,foreign_gross,year
3079,Avengers: Infinity War,BV,678800000.0,"1,369.5",2018
3080,Black Panther,BV,700100000.0,646900000,2018
3081,Jurassic World: Fallen Kingdom,Uni.,417700000.0,891800000,2018
3082,Incredibles 2,BV,608600000.0,634200000,2018
3083,Aquaman,WB,335100000.0,812700000,2018

In [132]:
df2 =pd.read_csv("tn.movie_budgets.csv")
df2.head(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At WorldÃ¢Â€Â™s End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"
10,11,"Jul 20, 2012",The Dark Knight Rises,"$275,000,000","$448,139,099","$1,084,439,099"
11,12,"May 25, 2018",Solo: A Star Wars Story,"$275,000,000","$213,767,512","$393,151,347"
12,13,"Jul 2, 2013",The Lone Ranger,"$275,000,000","$89,302,115","$260,002,115"
13,14,"Mar 9, 2012",John Carter,"$275,000,000","$73,058,679","$282,778,100"
14,15,"Nov 24, 2010",Tangled,"$260,000,000","$200,821,936","$586,477,240"
15,16,"May 4, 2007",Spider-Man 3,"$258,000,000","$336,530,303","$894,860,230"
16,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349","$1,140,069,413"
17,18,"Mar 25, 2016",Batman v Superman: Dawn of Justice,"$250,000,000","$330,360,194","$867,500,281"
18,19,"Dec 14, 2012",The Hobbit: An Unexpected Journey,"$250,000,000","$303,003,568","$1,017,003,568"
19,20,"Jul 15, 2009",Harry Potter and the Half-Blood Prince,"$250,000,000","$302,089,278","$935,213,767"